# ----------Задача---------
# ----------Решение--------

# import math

# # m = float(input("Введите расстояние: "))
# # n = float(input("Введите ежедневный пробег: "))
# m = float(5)
# n = float(3)
# print("Понадобится дней: ", f"{m // n + (m % n > 0):.0f}")
# print("Понадобится дней: ", int(m // n + (m % n > 0)))
# print("Понадобится дней: ", math.ceil(m / n))

# ----------Задача---------
# ----------Решение--------

# # print("Введите количество учеников в")
# # n1 = int(input("1-ом классе: "))
# # n2 = int(input("2-ом классе: "))
# # n3 = int(input("3-ом классе: "))
# n1 = 20
# n2 = 21
# n3 = 22
# parts1 = n1 // 2 + (n1 % 2 > 0)
# parts2 = n2 // 2 + (n2 % 2 > 0)
# parts3 = n3 // 2 + (n3 % 2 > 0)
# print("Понадобится парт: ", parts1 + parts2 + parts3)
# print("Понадобится парт: ", (n1 + 1) // 2 + (n2 + 1) // 2 + (n3 + 1) // 2)

# ----------Задача---------
# ----------Решение--------

# n1 = 3
# n2 = 5
# if n1==n2:
#     print("Недостаточно информации")
# else:
#     s = n1 + n2 - 1
#     print("Всего вагонов: ", s)

# ----------Задача---------
# ----------Решение--------

year = 2016

if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
    print("YES")
else:
    print("NO")
